BlogSn/app/controllers/publicaciones_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    @listaPublicaciones = Post.all

INSERT INTO "posts" ("titulo", "autor", "cuerpo", "fecha", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["titulo", "tercer Post"], ["autor", "e"], ["cuerpo", "d"], ["fecha", "2017-07-04"], ["created_at", "2017-07-31 22:31:22.275349"], ["updated_at", "2017-07-31 22:31:22.275349"]]
---
  def create
    @fotoname = params[:postNuevo][:imagen].original_filename
    @nuevoPost = Post.new( permitirParametrosNew )
    @nuevoPost.imagen = @fotoname
    @nuevoPost.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @titulo = 'Editar Post'
    @postEdit = Post.find( params[:id] )

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @postReview = Post.find( params[:id] )

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 5]]
---
  def destroy
    @postEliminar = Post.find(params[:id])
    @postEliminar.delete

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "autor" = ?, "cuerpo" = ?, "fecha" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["autor", "ichy"], ["cuerpo", "es mi cumpleaños!"], ["fecha", "2017-07-27"], ["updated_at", "2017-07-31 22:49:51.739435"], ["id", 4]]
---
  def update
    @postEdit = Post.find( params[:id] )
    @fotoname = params[:postEdit][:imagen].original_filename

    @postEdit.update(permitirParametrosEdit)